{
   "navigation": [
      "about", "services", "pricing", "team", "contact"
   ],
   "services": {
   },
   "profile":{
      "name":{
         "first":"Meet",
         "last":"DIFFY"
      },
      "desc":{
         "first":"Find production issues before your users find them"
      }
   },
   "team": [
      { 
         "image": "static/images/128_puneet.jpg",
         "name": "Puneet Khanduri",
         "title": "Founder / CEO",
         "summary": [
            "A veteran programmer and engineering leader with 11+ years in the industry. He developed Diffy at Twitter.",
            "He also helped start Twitter's India Engineering office as the site lead for 1.5 years while driving a stealth project across engineering, product, and design.",
            "Prior to Diffy, Puneet lead the ML Platform Services team at Twitter. Prior to Twitter, Puneet lead the Fulfillment Engineering team at Symphony Commerce. Puneet successfully launched a new cargo monitoring solution product as a product manager at Oracle and focused on small footprint JVM design and datacenter networking protocols as a researcher at Sun Microsystems (acquired by Oracle).",
            "In his career, Puneet has done everything from publishing research and writing code to managing teams and building products."
         ],
         "social":{
            "twitter": "https://twitter.com/pzdk",
            "linkedin": "https://www.linkedin.com/in/puneetkhanduri/"
         }
      },
      {
         "image": "static/images/128_prashant.jpg",
         "name": "Prashant Khanduri",
         "title": "Co-Founder / CTO",
         "summary": [
            "A solutions architect with over 8 years of experience in leading product design and implementation of technology solutions and processes.",
            "Prior to Diffy, he made significant technical contributions as a engineering manager / tech lead at Affirm, Jawbone, Hearsay systems and as a data scientist at Microsoft (Core Ranking, Bing).",
            "He holds a Masters degree in Computer Science (focus on ML / AI) from University of Southern California, US and a Bachelors in Computer Engineering from University of Waterloo, Canada.",
            "He is excited about eliminating logistical friction developers incur when trying to solve real world problems."
         ],
         "social": {
            "twitter": "https://twitter.com/khandurip",
            "linkedin": "https://www.linkedin.com/in/prashantkhanduri/"
         }
      }

   ],
   "contact":{
      "github": "opendiffy/diffy",
      "twitter": "diffyproject",
      "email": "mailto:info@diffy.ai?subject=Requesting a Demo!"
   },
   "experience":[
      {
         "fa_class":"fa-spin fa-th-large",
         "title":"Diffy",
         "link": "https://github.com/opendiffy/diffy",
         "loc":"San Fransisco, CA",
         "dates":"2018 - current",
         "position":"Co-Founder / CTO",
         "body":[
            {
               "team_desc":"An open source tool that allows developers to catch bugs before they are pushed to production",
               "duties":[
                  "More detail coming soon ..."
               ]
            }
         ]
      },
      {
         "fa_class":"fa-credit-card",
         "title":"Affirm",
         "link": "https://www.affirm.com/",
         "loc":"San Fransisco, CA",
         "dates":"2015 - 2018",
         "position":"Engineering Manager / Staff Engineer",
         "body":[
            {
               "team_name":"Platform team",
               "team_desc":"The team is responsible for building our own proprietary financial platform, as well as our real-time high-throughput data processing pipeline",
               "duties":[
                  "Build and maintain the underwriting pipeline for all product flows",
                  "Architect the offline infrastructure to be used by Data Science for iterating and improving credit and fraud models"
               ]
            }
         ]
      },
      {
         "fa_class":"fa-heartbeat",
         "title":"Jawbone",
         "link": "https://jawbone.com/",
         "loc":"San Fransisco, CA",
         "dates":"2014 - 2015",
         "position":"Senior Software Engineer",
         "body":[
            {
               "team_name":"Insights & Intelligence team",
               "team_desc":"The team is responsible for building an intelligent guide that helps our users make good health choices",
               "duties":[
                  "Building the core intelligence for the Smart Coach brand",
                  "Building the Insights system and the internal CRM system to manage the insight content"
               ]
            }
         ]
      },
      {
         "fa_class":"fa-comment-o",
         "title":"Hearsay Social",
         "link": "https://hearsaysystems.com/",
         "loc":"San Fransisco, CA",
         "dates":"2012 - 2014",
         "position":"Full stack developer",
         "body":[
            {
               "team_name":"Engagement team",
               "team_desc":"Team's goal was to keep the user engagement up and unblock any onboarding issues (growing the monthly active users)",
               "duties":[
                  "Designed and developed a notification platform for our software",
                  "Worked on building the analytics and reporting framework"
               ]
            }
         ]
      },
      {
         "fa_class":"fa-windows",
         "title":"Microsoft Inc",
         "link": "https://www.bing.com",
         "loc":"Seattle, WA",
         "dates":"2009 - 2012",
         "position":"SDE II",
         "body":[
            {
               "team_name":"Bing - Relevance",
               "team_desc":"Team was responsible for ranking the top documents in Bing's algorithmic web search results (Top 100K queries)",
               "duties":[
                  "Developing new algorithms to extract ranking signals and features from petabytes of user browsing activity logs",
                  "Using data mining and machine learning techniques to optimize user satisfaction metrics"
               ]
            },
            {
               "team_name":"Windows Live",
               "team_desc":"Worked with two separate groups (Service Management / Monetization) on delivering project critical components",
               "duties":[
                  "Implemented a service for syncing data from a system store to a DHCP server (for the server to hand out correct IP leases required for PXE booting)",
                  "Helped design the next generation monetization solution to better target Hotmail users"
               ]
            }
         ]
      },
      {
         "fa_class":"fa-code",
         "title":"Internships",
         "loc":"Various Locations",
         "dates":"2004 - 2009",
         "position":"Intern",
         "body":[
            {
               "team_name":"Microsoft Corporation",
               "team_desc":"Windows Live Mesh - May 2009 – Aug 2009",
               "duties":[
                  "Created an assembly that provisioned a delegated authentication token management service"
               ]
            },
            {
               "team_name":"Amazon.com Inc",
               "team_desc":"Personalization - Aug 2007 - Dec 2007",
               "duties":[
                  "Worked on a ranking mechanism to generate a tag set which describe the list recommended items"
               ]
            },
            {
               "team_name":"Sun Microsystems",
               "team_desc":"Complex Systems Group - Jan 2006 - Apr 2006",
               "duties":[
                  "Participated in the design and development of a simulation infrastructure for the behavioral analysis of wireless sensor networks"
               ]
            },
            {
               "team_name":"Amazon.com Inc",
               "team_desc":"Digital Media Technologies - May 2005 - Aug 2005",
               "duties":[
                  "Worked on the variety of upgrades to the digital media pipeline (mainly the first internal REST client to the S3 service)"
               ]
            },
            {
               "team_name":"Epson Canada",
               "team_desc":"Barcode Recognition - Jan 2004 - Apr 2004",
               "duties":[
                  "Developed a universal 2D barcode decoding application for hand-held image-scanners"
               ]
            }
         ]
      }
   ]
}
