{
   "navigation": [ "about", "features", "pricing", "team", "contact" ],
   "profile":{
      "name":{
         "first":"Meet",
         "last":"DIFFY"
      },
      "desc":{
         "first":"Find production issues before your users find them"
      }
   },
   "team": [
      {
         "image": "static/images/128_puneet.jpg",
         "name": "Puneet Khanduri",
         "title": "Founder / CEO",
         "summary": [
            "A veteran programmer and engineering leader with 11+ years in the industry. He developed Diffy at Twitter.",
            "He also helped start Twitter's India Engineering office as the site lead for 1.5 years while driving a stealth project across engineering, product, and design.",
            "Prior to Diffy, Puneet lead the ML Platform Services team at Twitter. Prior to Twitter, Puneet lead the Fulfillment Engineering team at Symphony Commerce. Puneet successfully launched a new cargo monitoring solution product as a product manager at Oracle and focused on small footprint JVM design and datacenter networking protocols as a researcher at Sun Microsystems (acquired by Oracle).",
            "In his career, Puneet has done everything from publishing research and writing code to managing teams and building products."
         ],
         "social":{
            "twitter": "https://twitter.com/pzdk",
            "linkedin": "https://www.linkedin.com/in/puneetkhanduri/"
         }
      },
      {
         "image": "static/images/128_prashant.jpg",
         "name": "Prashant Khanduri",
         "title": "Co-Founder / CTO",
         "summary": [
            "A solutions architect with over 8 years of experience in leading product design and implementation of technology solutions and processes.",
            "Prior to Diffy, he made significant technical contributions as a engineering manager / tech lead at Affirm, Jawbone, Hearsay systems and as a data scientist at Microsoft (Core Ranking, Bing).",
            "He holds a Masters degree in Computer Science (focus on ML / AI) from University of Southern California, US and a Bachelors in Computer Engineering from University of Waterloo, Canada.",
            "He is excited about eliminating logistical friction developers incur when trying to solve real world problems."
         ],
         "social": {
            "twitter": "https://twitter.com/khandurip",
            "linkedin": "https://www.linkedin.com/in/prashantkhanduri/"
         }
      }

   ],
   "contact": {
      "github": "opendiffy/diffy",
      "twitter": "diffyproject",
      "email": "mailto:info@diffy.ai?subject=Requesting a Demo!"
   }
}
